{
    "version": "0.6",
    "pageContent":
	{
        "_comments": "JSON object that contains data for page labels, buttons, etc.",
        "navItems":
		{
            "_common":
      			{
                "buttonBackToGallery":
        				{
                    "name": "Back To Gallery",
          					"method": "backToGallery()",
          					"idName": "backToGallery"
                },
                "buttonStartTutorial":
        				{
                    "name": "Start Tutorial",
          					"method": "startTutorialFromDetailsScreen()",
          					"idName": "startTutorial"
                },
        				"buttonViewDetails":
        				{
                    "name": "View Details",
          					"method": "viewDetails()",
          					"idName": "stepsViewDetails"
                }
            }
        }
    },
    "tutorial":
  	{
        "_common":
    		{
            "name": "MessageFlow Statistics",
            "shortDescription": "Learn how turn on messageflow statistics tracking and view them in the WebUI.",
            "durationText": "This tutorial takes approximately",
            "durationTime": "15 minutes",
            "_resourceToOpenComment": "The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
            "resourceToOpen": "EventRoutingFlow",
            "helpLink":
      			{
                "text": "IBM Knowledge Center",
                "link": "/com.ibm.etools.msgbroker.helphome.doc/help_home_msgbroker.htm"
            }
        },
        "pageDetails":
    		{
            "topicsName": "Tutorial Topics",
            "_topicListComment": "A short list of product concepts or tasks demonstrated by this tutorial",
            "topicList":
      			[
                {
                    "title": "Finding and editing the server config file"
                },
                {
                    "title": "Manually enabling messageflow statistics tracking"
                },
                {
                    "title": "Accessing the WebUI"
                },
                {
                    "title": "Viewing the statistics panel"
                }
            ],
            "outcomesName": "Learning outcomes",
            "_outcomesComment": "A description of what the user will have learned or accomplished by running this tutorial.",
            "outcomeList":
      			[
                {
                    "title": "Understand how to locate the server config file, turn on messageflow statistics tracking and monitor them in real time using the WebUI. "
                }
            ],
            "summary":
      			{
                "overviewName": "OVERVIEW",
                "_overviewComment": "A short description of what happens in this tutorial, and an optional short explanation of the IIB concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
                "sections":
        				[
                    {
                        "section": "This tutorial shows how a user would go about enabling messageflow statistics tracking and then monitor said statistics in real-time. The example uses a simple message flow to demonstrate some new usefule techniques."
                    },
                    {
                        "section": "The server.conf.yaml file will be introduced as a useful way for tweaking the behaviour of an integration server. In this example we will only enable messageflow statistics tracking."
                    },
                    {
                        "section": "Finally, the user will make several requests to the server before being guided through accessing the WebUI of said server. They will then be shown where to find the statistics in the WebUI."
                    }
                ]
            }
        },
        "pageSteps":
    		{
            "create":
      			{
                "overview":
        				{
                    "name": "Create",
                    "heading": "Import projects",
                    "_createComment": "A description of what will happen when the user clicks Import.",
                    "sections":
          					[
                        {
                            "section": "Click <span class='uicontrol'>Import</span> and the <span class='application'>StatsApp</span> application along with its .BAR file, <span class='application'>StatsBar</span>."
                        },
                  			{
                  			    "section": "This simple application contains a message flow which simply receives HTTP data and echoes it back to the requesting client. Once we have created an Integration Server we will deploy this example flow later in the tutorial."
                  			}
                    ]
                },
                "actions":
        				{
                    "title": "Create Actions",
                    "details":
          					[
                        {
                            "name": "Import",
                            "method": "importArtifacts()"
                        }
                    ]
                }
            },
            "prepare":
      			{
                "overview":
        				{
                    "name": "Prepare",
                    "heading": "Prepare an Integration Server",
                    "_prepareComment": "Enable resource statistics tracking:",
                    "sections":
          					[
                      {
                        "steps":
                        {
                          "type": "ordered",
                          "details":
                          [
                            {
                                "details": "Assuming you are using a Windows platform, open an App Connect Enterprise Command Console and run the following command: <br><code>mqsicreateworkdir C:\\StatsServer</code><br> where <b>C:\\StatsServer</b> will the working directory for your Integration Server."
                            },
                            {
                                "details": "Navigate to your server's working directory and locate the file 'server.conf.yaml'. Open it using your preffered text editor and set the following parameters: <span class='code'>messageFlowMonitoring: active<br>StatsSnapPublicationOn: active<br>StatsSnapNodeDataLevel: advanced<br>StatsSnapOutputFormat: 'json'<br>StatsSnapThreadDataLevel: basic<br>StatsSnapAccountingOrigin: basic</span><br> Save and close this file."
                            },
                            {
                                "details": "Now start the server by entering: <br><code>IntegrationServer --work-dir C:\\StatsServer --name StatsServer --admin-rest-api 7600 --http-port-number 7800 --console-log</code><br> into an ACE Command Console."
                            },
                            {
                                "details": "Connect to the server in the toolkit then deploy the StatsBar.bar file to the server."
                            },
                            {
                                "details": "Right click on the server in the Toolkit and launch the WebUI."
                            }
                          ]
                        }
                      }
                    ]
                },
                "actions":
        				{
                    "title": "Prepare Actions",
                    "details":
          					[
                        {
                            "name": "Deploy",
                            "method": "deployArtifacts()"
                        }
                    ]
                }
            },
            "run":
      			{
                "overview":
        				{
                    "name": "Run",
                    "heading": "Follow these steps to complete the tutorial",
                    "_runComment": "The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
                    "sections":
          					[
                        {
                            "section": "Follow the following steps to complete the tutorial.",
                            "steps":
              							{
                                "type": "ordered",
                                "details":
                								[
                                    {
                                        "details": "Navigate to a Command Prompt and run this command a handful of times:<br><code>curl -X POST http://localhost:7800/request -d HelloWorld</code>"
                                    },
                                    {
                                        "details": "Assuming you did not get a 404 from the server, navigate to the WebUI for the server."
                                    },
                                    {
                                        "details": "Navigate to the 'Statistics' tab on the navigation bar, then in the drop-down menu on the left select 'Message flow statstics' and wait a moment."
                        				    },
                        				    {
                                        "details": "After a brief pause, you should see some records labelled 'Request' and 'internalReply' with various statistics about them. Notice that the values in the 'Total input messages' fields corresponds directly to the amount of curl requests you made to the server."
                        				    },
                        				    {
                                        "details": "To get a more detailed view of how data is passing through your flows, change the view to 'Flow node statistics' in the 'Showing' drop-down."
                        				    },
                        				    {
                                        "details": "Each record in the previous screen corrsponded to an entire Flow, while in this view each record represents an individual Node in a Flow. On the right hand side you can see which Flow each Node belongs to."
                          					},
                                    {
                                        "details": "When you're ready to conclude this tutorial, stop the Integration Server in the Command Console and close your browser."
                          					}
                                ]
                            }
                        }
                    ]
                },
				"exits":
				{
					"title": "Run Exits",
					"details":
					[
						{
							"name": "Clean Up",
							"description": "Clean up and remove any changes in your workspace made by the tutorial.",
							"method": "cleanUp()"
						}
					]
				}
            }
        }
    }
}
